[
    {
        "name": "Dian Mian Hu",
        "chinese_name": "鼎边糊",
        "description": "a unique noodle soup from Sibu, has roots in the migration of Fuzhou settlers. Its name translates to \"wok edge paste\" in Chinese, alluding to its distinctive preparation method. The star of the dish is the flat noodles made from a rice flour batter. This batter is poured along the edge of a hot wok, forming thin dough upon contact. Skilled hands scrape this into the soup, creating the distinct noodles. The soup is a masterpiece, usually featuring a blend of pork and cuttlefish stock, enhanced with local ingredients like Sarawakian white pepper. Diners can add extra flavor with a dash of this aromatic pepper. Some variations even offer a curry-based soup, showcasing local influence",
        "type": "local_cuisine"
    },
    {
        "name": "Dian Mian Hu is a sought-after delicacy, primarily enjoyed in eateries due to its specialised preparation techniques",
        "chinese_name": "",
        "description": "It is available at several stalls as a hefty breakfast or a late night supper",
        "type": "local_cuisine"
    },
    {
        "name": "Kompia",
        "chinese_name": "光饼",
        "description": "often referred to as \"Foochow bagels\", is a delightful bread akin to bagels with its origins in Fuzhou, China. It made its way to Malaysian towns with a thriving Fuzhou Chinese community, becoming a culinary gem. Legend has it that Kompia was invented by Qi Jiguang, who designed it with a hole in the center for easy portability during military campaigns. The dough is prepared from wheat flour, baking soda, yeast, salt, and water, then shaped into balls with a hole in the center. Traditionally baked in clay ovens, modern versions use conventional ovens",
        "type": "local_cuisine"
    },
    {
        "name": "Kompia can be enjoyed plain or with sesame seeds, and regional variations abound",
        "chinese_name": "",
        "description": "In Sibu, it's often served with stewed pork mince, but creative adaptations include Kompia with donut icing, rojak sauce, and even as a cheeseburger, showcasing its versatility. Traditional soft kompia dipped in pork mince sauce can be sought from Chung Hua road, the Sunday Market at Pedada road, and Sibu Central Market. There are deep fried variations available throughout the town of Sibu",
        "type": "local_cuisine"
    },
    {
        "name": "Bian Nyuk",
        "chinese_name": "扁肉",
        "description": "meaning 'flattened meat' in the Foochow dialect, is a cherished dish in Sibu, celebrated for its rich Foochow culinary heritage. This delightful wonton-type dish features a thin and translucent skin called yanpi, which is meticulously crafted without the use of alkaline water, giving it a unique ability to melt in your mouth. Unlike traditional wontons, Bian Nyuk boasts thinner skin and a lighter, less greasy texture. It is typically filled with lean and finely minced pork, resulting in a delicate texture and exquisite taste. Often enjoyed alongside another Sibu breakfast staple, Kampua noodles, Bian Nyuk comes in both soup and dry-tossed variations. Served in various flavours, including the classic white and savoury black with dark soy sauce",
        "type": "local_cuisine"
    },
    {
        "name": "Bazhen Soup",
        "chinese_name": "八珍汤八珍药",
        "description": "one of the well-known herbal soups in Sibu. Many people love to drink it since young. It is made up of two recipes of soup, Sijunzi Soup (Four Gentlemen Soup) and Siwu Soup (Four Substance Soup). The Codonopsis, Atractylodes, Poria and Licorice in the recipe are the ingredients from Sijunzi Soup. While the Shudi, Baishao, Angelica and Chuanxiong are the ingredients from Siwu Soup. These eight types of Chinese herbs add up to become Bazhen Tang, which traditionally help to nourish qi and blood, strengthen the spleen and stomach, and relieve fatigue",
        "type": "local_cuisine"
    },
    {
        "name": "Bazhen Soup should be evenly proportioned with sufficient ingredients to make the taste authentic",
        "chinese_name": "",
        "description": "When paired with Fuzhou longevity noodles, it turns into a delicious dish",
        "type": "local_cuisine"
    },
    {
        "name": "Bazhen soup packed could be purchased easily from traditional Chinese herbal shops in Sibu town like Poh Guan Hong and Chew Hock Choon",
        "chinese_name": "",
        "description": "",
        "type": "local_cuisine"
    },
    {
        "name": "Sarawak Laksa",
        "chinese_name": "",
        "description": "a renowned soup noodle dish originating from Sarawak, is celebrated for its distinctive shrimp-based broth and complex laksa spice paste. This paste, comprising various aromatic ingredients, is sautéed to perfection before being combined with chicken and prawn broth and coconut milk. The broth is seasoned with soy sauce, vinegar, or fish sauce for a balanced flavor. Typically served with thin rice vermicelli noodles and a variety of garnishes including spring onions, prawns, chicken, and egg omelette, Sarawak Laksa is enhanced with a side of shrimp paste and chilli sambal belacan. A halved kalamansi lime is also provided to brighten the dish with a citrusy touch. Renowned chef Anthony Bourdain hailed it as the \"breakfast of the gods\", making it a must-try for food enthusiasts worldwide",
        "type": "local_cuisine"
    },
    {
        "name": "Tebaloi",
        "chinese_name": "",
        "description": "is a traditional Melanau snack closely linked to the Sarawak region, particularly the Mukah and Dalat districts. It's made from sago flour, desiccated coconut, eggs, and sugar, which are mixed to create a dough. This dough is then flattened on a banana leaf and cooked over a wood fire stove, giving it a unique smoky flavor. Once cooked, the dough is cut into squares, flattened further, and dried to achieve its signature crispiness",
        "type": "local_cuisine"
    },
    {
        "name": "Tebaloi comes in various flavours today but maintains its historic ties to the Melanau people's culture and traditions",
        "chinese_name": "",
        "description": "You can find it in Sibu Central Market and enjoy its delightful textures and tastes during tea time",
        "type": "local_cuisine"
    },
    {
        "name": "Kek Lapis Sarawak",
        "chinese_name": "",
        "description": "is a popular layered cake in Sarawak, known for its vibrant colours and intricate designs. Originating from Indonesia, it was introduced in the 1970s and 1980s and later adapted by Sarawakians with unique flavours and colours. This cake is made using Western cake-making techniques, with a batter of flour, eggs, milk, butter, and various flavourings and colours baked in thin layers. These layers are carefully assembled and bound with condensed milk or jam. The cake's cross-section reveals its kaleidoscopic beauty, showcasing the skill and attention to detail in its creation",
        "type": "local_cuisine"
    },
    {
        "name": "Kek Lapis Sarawak is a protected geographical indication of Sarawak since 2010, ensuring its authenticity and quality",
        "chinese_name": "",
        "description": "",
        "type": "local_cuisine"
    },
    {
        "name": "Kek Lapis Sarawak can be found easily at Sibu Central Market",
        "chinese_name": "",
        "description": "",
        "type": "local_cuisine"
    },
    {
        "name": "Manok Pansoh",
        "chinese_name": "",
        "description": "a cherished dish among the Dayak community in Sarawak, involves cooking marinated chicken inside a bamboo stalk, infusing it with a unique flavor. The chicken is prepared with a mix of aromatic ingredients, including ginger, lemongrass, and more. This marinated chicken is then stuffed into bamboo, sealed with tapioca leaves, and roasted over an open fire, creating a delightful and aromatic dish",
        "type": "local_cuisine"
    },
    {
        "name": "Manok Pansoh's exact origin remains a mystery, but its ingenuity and simplicity make it a beloved tradition, initially served during the Gawai Dayak festival but now enjoyed widely at various occasions",
        "chinese_name": "",
        "description": "",
        "type": "local_cuisine"
    },
    {
        "name": "Terung Asam",
        "chinese_name": "",
        "description": "is a unique and sour-tasting fruit cherished by Sarawak's Dayak community. Unlike regular aubergines, it has a round shape, dark green skin turning yellow when ripe, and firm, bright yellow flesh with small seeds in the center",
        "type": "local_cuisine"
    },
    {
        "name": "Terung Asam is not only distinct in appearance but also offers impressive nutrition, including vitamin C, calcium, fibre, phosphorus, and potassium",
        "chinese_name": "",
        "description": "It's commonly used in Sarawak-style sour and spicy soups, where it's combined with lemongrass, chili, ginger, and various proteins like fish, poultry, or meat. Grilling Terung Asam and making it into a spicy sambal is another popular approach. Some even use it to create unique Terung Asam-flavoured ice cream",
        "type": "local_cuisine"
    },
    {
        "name": "Empurau",
        "chinese_name": "",
        "description": "known as the \"King of the River\", is Malaysia's priciest fish, inhabiting clear, swift rivers with a unique taste influenced by its diet of native fruits. Its slow growth contributes to its high cost, with larger specimens fetching prices up to RM2000 per kg. Typically steamed or eaten raw, it offers a delicate flavor and edible scales that chefs transform into crispy snacks. However, wild Empurau populations are dwindling due to overfishing and habitat loss, prompting conservation efforts",
        "type": "local_cuisine"
    },
    {
        "name": "Rojak Kassim",
        "chinese_name": "",
        "description": "Indian-style rojak (also known as pasembur or Mamak Rojak)",
        "type": "local_cuisine"
    },
    {
        "name": "You Zhar Gui",
        "chinese_name": "油炸桧油條",
        "description": "deep fried twin dough batter often dipped in soup or chili sauce. It is often eaten together with porridge or Bak Kut Teh (肉骨茶).",
        "type": "local_cuisine"
    }
]